[
  {
    "title": "Integration Technician (Fairings)",
    "sub": "SpaceX – Cape Canaveral, FL | 2022 – Present",
    "description": "As an Integration Technician at SpaceX, I manage weekend shifts and ensure the precise installation of sensitive spacecraft hardware. My role involves high-paced execution of critical operations and the integration of both commercial and government spacecraft.",
    "perks": [      
      "Highly detailed and quality installation of sensitive spacecraft hardware and components",
      "High paced execution procedures for critical path operations",
      "Integration of commercial/government spacecraft"
    ],
    "url": "https://www.spacex.com/"
  },
  {
    "title": "Aircraft Technician",
    "sub": "Everts Air Fuel - Fairbanks, AK",
    "description": "I performed extensive maintenance on various aircraft, including the Douglas DC-6, Curtiss C-46 Commando, Air Tractor AT-802, and Cessna 172. My responsibilities included powerplant inspections, sheet metal work, and troubleshooting and resolving technical issues.",
    "perks": [
      "Extensive maintenance on the Douglas DC-6, Curtiss C-46 Commando, Air Tractor AT-802, Cessna 172",
      "Powerplant inspections and sheet metal",
      "Documented, troubleshooted and resolved technical issues"
    ],
    "url": "https://evertsair.com/fuel"
  },
  {
    "title": "UTV Technician",
    "sub": "Rye N Shine LLC – Columbia, TN",
    "description": "As a UTV Technician at Rye N Shine LLC in Columbia, TN, diagnosed and troubleshooted electrical/mechanical issues, rebuilt faulty assemblies on primary systems, conducted roll cage fabrication and modifications with precision and attention to detail, ensuring the utmost safety and functionality of the vehicles.",
    "perks": [
      "Diagnosing and troubleshooting electrical/mechanical issues.",
      "Rebuilt faulty assemblies on primary systems.",
      "Roll cage fabrication and modifications."
    ],
    "url": ""
  },
  {
    "title": "Helicopter Crew/Firefighter ICT5-T (Squad Boss)",
    "sub": "Division of Forestry – Delta Junction, AK",
    "description": "Helicopter Crew/Firefighter ICT5-T (Squad Boss) at Division of Forestry in Delta Junction, AK. First responder, led a crew of 5 to achieve 100% containment. Evaluated weather, terrain, and fire behavior. Established escape routes and landing zones. Transported cargo and passengers with helicopter teams and fire engines.",
    "perks": ["First responder, initial attack, Supervised a crew of 5 until 100% containment.", "Evaluated weather data, topography, fuel types and fire behavior.", "Established escape routes and safe landing zones"],
    "url": "https://dnr.alaska.gov/burn"
  },
  {
    "title": "Auto Mechanic",
    "sub": "Viktor’s Auto Sales – Delta Junction, AK",
    "description": "Auto Mechanic at Viktor’s Auto Sales in Delta Junction, AK. Developed comprehensive checklists tailored to American, Japanese, and European vehicles. Performed thorough inspections of all major systems. Implemented improvements to the company's documentation system, ensuring more accurate and efficient filing processes.",
    "perks": [
      "Crafted checklist for American, Japanese and European vehicles",
      "Conducted full inspections of all major systems",
      "Restructured company documenting system for more accurate filing"
    ],
    "url": ""
  }
]
